In [1]:
import pandas as pd
import numpy as np

In [3]:
xlsx=pd.ExcelFile('E:/Capgemini/Demandv1.1.xlsx')
Headcount= pd.read_excel(xlsx, 'Headcount')
Demand_Trend=pd.read_excel(xlsx, 'Demand Trend Last year')

In [4]:
Headcount.head()

,Region,Employee Code,Last Name,Local Date of Joining,Designation,Status,Market Unit,SkillList,Location
0,US,45149,AALLURI,2016-10-31,CONSULTANT,Billable,BANK,Salesforce (Functional),Bangalore
1,IN,47875,AARATTUKULAM,2014-11-20,SENIOR SOFTWARE ENGINEER,Billable,BANK,"Amazon Web services - Build , Administration a...",Bhubaneswar
2,IN,90386,AASHIK,2014-12-15,ASSOCIATE CONSULTANT,Billable,BANK,"Amazon Web services - Build , Administration a...",Pune
3,IN,41161,Aastha,2015-02-26,ASSOCIATE CONSULTANT,Billable,BANK,Test Automation,Bhubaneswar
4,IN,92293,ABBAN,2013-12-02,CONSULTANT,Billable,BANK,PMO (Account),Noida

In [5]:
Demand_Trend.head()

,Month DD Raised,No. of FTE Request Raised,SkillList,Location,Experience Grade,Practice,Skill Group,Demand Source
0,May,4,Salesforce (Functional),Bangalore,A4,BANK,(F) IT Operations,Account
1,October,2,"Amazon Web services - Build , Administration a...",Bhubaneswar,B2,M&FT,(F) IT Operations,Account
2,March,2,"Amazon Web services - Build , Administration a...",Pune,A3,TEST,NaN,Support
3,October,1,Test Automation,Bhubaneswar,B2,M&FT,(F) IT Operations,Account
4,June,2,PMO (Account),Noida,A5,I&D,(D) Banking Sector,Proactive

In [6]:
Headcount.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
Region                   10000 non-null object
Employee Code            10000 non-null int64
  Last Name              10000 non-null object
Local Date of Joining    10000 non-null datetime64[ns]
Designation              9992 non-null object
Status                   10000 non-null object
Market Unit              9859 non-null object
SkillList                10000 non-null object
Location                 9987 non-null object
dtypes: datetime64[ns](1), int64(1), object(7)
memory usage: 703.2+ KB

In [7]:
Demand_Trend.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1023 entries, 0 to 1022
Data columns (total 8 columns):
Month DD Raised              1023 non-null object
No. of FTE Request Raised    1023 non-null int64
SkillList                    1023 non-null object
Location                     1023 non-null object
Experience Grade             1023 non-null object
Practice                     1023 non-null object
Skill Group                  981 non-null object
Demand Source                1023 non-null object
dtypes: int64(1), object(7)
memory usage: 64.0+ KB

In [8]:
Headcount.Location.value_counts()

Pune           1925
Bhubaneswar    1826
Gurgaon        1711
Noida          1554
Hartford        848
Hyderabad       846
Bangalore       646
Chennai         631
Name: Location, dtype: int64

In [9]:
Headcount.Designation.value_counts()

CONSULTANT                  2552
SENIOR CONSULTANT           2349
ASSOCIATE CONSULTANT        2176
MANAGER                     1551
SENIOR MANAGER               482
DIRECTOR                     307
PORTFOLIO MANAGER            205
SENIOR DIRECTOR              145
SENIOR SOFTWARE ENGINEER     118
VICE PRESIDENT                67
EXECUTIVE VICE PRESIDENT      32
SOFTWARE ENGINEER              8
Name: Designation, dtype: int64